let phrases = [
    { text: ' видим. Птицы возвращаются чистые, Балтийское солнце оставляя с правого бока. Не помню, где это, год 52-ой.', 
    image: 'https://cdn-icons-png.flaticon.com/512/136/136712.png'},
    { text: '. Постукивает с вечера вчерашнего наш дом всеми балконными приспособлениями. Продува­ется городская окраина. Люди в весенней одежде дер­жатся кучей, чтобы не унесло, как цветные лоскутья бумаги. Воскресение. Весной не страшно. Холодно по­ настоящему. Только после этого установились утрен­ники, в хорошее солнечное утро у нас между домами сизый туман, не похоже на любую другую погоду.', 
      image: 'https://cdn-icons-png.flaticon.com/512/136/136712.png'},
    { text: ' не продержался долго и нанес с севера снега. Сегодня, слышно, начинает таять. Варю свежий индийский чай.', 
      image: 'https://cdn-icons-png.flaticon.com/512/136/136712.png'},

    { text: ' колышет остатки листьев. Здесь совсем не растут сосны и ели. Да, да, люди вспомнили вре­мя года и оделись почти сразу по-зимнему. Небо без­облачно, кошки вышли посидеть на опавшей листве.', 
    image: 'https://cdn-icons-png.flaticon.com/512/136/136712.png'},

    { text: ' дует и к ночи обещают усиление ветра. Ничего не говорят - есть еще угроза наводнения или нет. Это было двухсотпятидесятое в истории города.', 
    image: 'https://cdn-icons-png.flaticon.com/512/136/136712.png'},

    { text: '. Вообше же зима на редкость мягкая, все еще городу угрожает наводнение.', 
    image: 'https://cdn-icons-png.flaticon.com/512/136/136712.png'},
 
    { text: ' еще неслышим, лишь дыхание ровное и мощное, как кажется, распро­страняющееся и по комнатам, предвещает новый по­рыв. И тут же он начинает дуть, как бы в какой-то примитивный фагот или другой музыкальный инструмент. Иногда эти партии продолжаются подолгу, иногда какие-то обрывочные.', 
    image: 'https://cdn-icons-png.flaticon.com/512/136/136712.png'},

    { text: ' стих, несмотря на мороз, кажется теп­ло. Солнце не греет, но погода очень мягкая, люди ходят по бульвару, чтобы побыть в его лучах. Поти­хоньку, может, и чувствуется тепло.', 
    image: 'https://cdn-icons-png.flaticon.com/512/136/136712.png'},

    { text: ' воет между домами, продувает все щели, открывает дверь. В вентиляци­онной шахте он ревет, как реактивный самолет. Вста­ют сегодня попозже, а спать ложатся пораньше. Всем этим группам по борьбе со стихийными бедствиями вообще не спать. - Что, Вера, завтра будем на лод­ ках плавать? - До нас не достанет.', 
    image: 'https://cdn-icons-png.flaticon.com/512/136/136712.png'},

    { text: ' не стихал всю ночь. Навер­ное, наломал льда. Как-то на Неве, на заливе? Пос­леднее время стали привыкать к подъемам воды. В Новый год произошло сильное землетрясение в Японии.', 
    image: 'https://cdn-icons-png.flaticon.com/512/136/136712.png'},

    { text: ' стих и стало теплее. Дома не так холодно, и можно ходить разде­тым. Когда так буря прервется, как-то меньше начи­наешь уставать, под ветер все тянет в сон, а сегодня и был-то всего косяк, долго сидел ночью и чувствовал себя совсем легко, думал о том, что я прав, выбрав тысяча девятьсот семьдесят четвертый год как счаст­ливый для предсказаний землетрясений.', 
    image: 'https://cdn-icons-png.flaticon.com/512/136/136712.png'},

    { text: ' утих и утух, и стало много легче, раньше я этого не замечал, давно, во всяком случае. Три градуса тепла - курорт. Бросили пить, деньги нужнее. Я вспо­минаю одних и тех же людей и одни и те же дела и чувствую, как тревоги сменяются успокоенностью.', 
    image: 'https://cdn-icons-png.flaticon.com/512/136/136712.png'},

    { text: ' дует. С пьяных глаз я этого не заме­чаю сначала. На Финском волны под два метра. Где­ то вдали слышно непрерывное гудение, а у нас ветер налетает порывами.', 
    image: 'https://cdn-icons-png.flaticon.com/512/136/136712.png'},

    { text: ' утих. «Известия» снова интересно читать. Сообщается, что одна американская газета писала, что атомоход «Ленин» продали на металлолом Южной Корее. Было это в семьдесят девятом году. Вышла книга переводов с пушту стихов одного поэта, афганского или пакистанского, Михаила Еремина. Ее продают только по заказу. Достали и чая, говорят, бо­лее дорогого, как в Англии.', 
    image: 'https://cdn-icons-png.flaticon.com/512/136/136712.png'},
    
    { text: ' утих. В газете пишут, что в области намело пятиметровые сугробы и было прервано сообщение. Передают, что в Австрии, Венгрии, Швейцарии и по всей Италии, вплоть до Сицилии, выпали большие снега, много людей погибло. В Югославии переносят соревнования. А в Северной Европе реки вышли из берегов: в Бельгии, ФРГ, Англии.', 
    image: 'https://cdn-icons-png.flaticon.com/512/136/136712.png'},

    { text: ' юго-западный до двадцати метров в секун­ду. У нас в Купчине снега не было, третий день под­таивает.', 
    image: 'https://cdn-icons-png.flaticon.com/512/136/136712.png'},

    { text: ' студит руки, и, пожалуй, далеко не стоит идти. Лед тает, так что среди дня будет час, когда запахнет весной, но точ­нее я этого времени не ловлю. Минус. Я уже пе­реоделся в весеннюю одежду, да на март надежды пло­хи, пока солнце, а завтра, может быть, наступят хо­лода. Теплится жизнь у пивных ларьков, тут что-то го­ворится и произносится.', 
    image: 'https://cdn-icons-png.flaticon.com/512/136/136712.png'},

    { text: ' завывает над домом, но в квартире довольно тепло, сижу раздетый. Да, да - мне важно, чтобы этот дневник остался от этого времени и от времени месяц вперед. Пытаюсь вызволить забытую мысль, чтобы, ах да, вспомнить, о чем подумалось, пока я так бродил по кухне. Не вспомнить, но что дальше было, я все честно описал. И дальше и раньше. Тут надо как-то разделять даль­ше от раньше.', 
    image: 'https://cdn-icons-png.flaticon.com/512/136/136712.png'},

    { text: ' гнет, метель слепит, впереди ничего, кроме пелены снега, не видно. Силуэты лю­дей возникают в туманной мгле. Все же день обыч­ный, хотя сегодня нападало снегу больше, чем за всю предьщущую осень. Мы живем при начале зимы, го­род прикрыт тучами, ждем потепления . Дети еще могут чего-то ждать от снегопада, а остальные удов­летворены полностью, даже с избытком.', 
    image: 'https://cdn-icons-png.flaticon.com/512/136/136712.png'},

    { text: ' целый день завывал над домом, в дверях и в вентиляционных отдушинах. Собирался помьпься, но было очень холодно даже дома. Вечером Верочка принесла «вермута», я напился и заснул, не помню как. Она еще разговаривала по телефону с мамой и пыталась смотреть телевизор, но я этого уже ничего не слышал. А сегодня у нее вечер книголюбский, я оставлен на весь день один.', 
    image: 'https://cdn-icons-png.flaticon.com/512/136/136712.png'},

    { text: ' еще не стих, но завываний уже не слышно.', 
    image: 'https://cdn-icons-png.flaticon.com/512/136/136712.png'},

    { text: ' северо-восточный, но почему-то стало теплее — минус тринадцать. Обещали, что температура поднимется до восьми градусов. А на лестнице уже весенние запахи — не то переваренная томатная паста, не то проветривают заваль какую-то. Вот и все новости. Это я ощущаю, когда иду за газетой. Все же еще холодно.', 
    image: 'https://cdn-icons-png.flaticon.com/512/136/136712.png'},

    { text: ' взрывами какими-то принимается шуметь и тогда сразу стучит дверью и воет в трубах вентиляции. Потом умолкает, собирается с новой силой. Снова. Снова.', 
    image: 'https://cdn-icons-png.flaticon.com/512/136/136712.png'},

    { text: ' с залива продолжает дуть. Очень сильно завывает вокруг дома, двери рвет, что-то погромыхивает. Разбилось одно стекло где-то на лестнице, зазвенело, падая.', 
    image: 'https://cdn-icons-png.flaticon.com/512/136/136712.png'},
    
    { text: ' утих, говорят, что в северных шведских провинциях он причинил боль­ шой ущерб лесам и жилью. Одна женщина погибла в автомобиле, ее сдуло с дороги. Очень много повален­ ных деревьев, и прервалась на сутки связь с внешним миром таких городов, как Кируна.', 
    image: 'https://cdn-icons-png.flaticon.com/512/136/136712.png'},

    { text: ' снова переменился на западный. Прогноз на праздники не особенно хороший. Не было бы на­воднения. На дамбе приостанавливали работы из-за шторма в предыдущее наводнение, но через день на­чали снова. Чай есть, беломор запасен, но никак мы праздники не отмечаем. Седьмого Верочка будет у своих, а вообще, мы поедем к маме. Гроза, густой снег.', 
    image: 'https://cdn-icons-png.flaticon.com/512/136/136712.png'},

    { text: ' очень сильный. В летних брю­ ках даже и холодно. Пришел с почты и сразу заварил себе чая. Выпил почти чайник заварки.', 
    image: 'https://cdn-icons-png.flaticon.com/512/136/136712.png'},

    { text: ' переменных направлений, и вот и от окна дует, и дверь приоткрывается самопроизвольно. Когда про­ветриваю, холодно в моем углу, ну а потом все же могу там сидеть и писать. Или просто сидеть и ку­рить.', 
    image: 'https://cdn-icons-png.flaticon.com/512/136/136712.png'},

    { text: ' стал слышен в вентиляции. Верочке выписали бюллетень на три дня, а потом к врачу. Я сделал укол в пятницу тридцать первого и теперь мне не скоро снова идти в диспансер. Перед Съездом нужно будет уколоться. Спокойно. Сейчас так, как я читал у себя в дневнике, кажется, не хва­тают. Долгая история с переездом.', 
    image: 'https://cdn-icons-png.flaticon.com/512/136/136712.png'},

    { text: ' утих. Я встаю рано. Трясет ночью Таджикистан, Ишкашим посильнее, Душанбе - послабее. Извергается Этна. Последний раз извергалась в 84 и 85 годах. И землетрясение в Греции, там же, повторяющееся в понедельник и в ночь на вторник. Паника, раненые. И в среду земле­трясение в районе Файзабада. Посильнее.', 
    image: 'https://cdn-icons-png.flaticon.com/512/136/136712.png'},

    { text: ' стих, я выходил на минутку, погода мягкая. Снег. Эту зиму пережить наша задача. Зима началась поздно. Сейчас воскресенье, всеобщие выборы на Тайване, демон­страции в Париже. Новостей особенных никаких нет. Телевизор не смотрю. Донбасс. Светлый денек.', 
    image: 'https://cdn-icons-png.flaticon.com/512/136/136712.png'},

    { text: ', дождь и боль хлещут в лицо, в мелкие кло­ чья, с характерным звуком, рвется туман. Осколки зуба на верхней десне ощущаются как звезда. Звезда Боле - сила ветра.',
    image: 'https://cdn-icons-png.flaticon.com/512/136/136712.png'},

  ];

  

  
   function getRandomElement(arr) {
    let randIndex = Math.floor(Math.random() * arr.length);
    return arr[randIndex];
  }
  
  let button = document.querySelector('.button');
  let phrase = document.querySelector('.phrase');
  let advice = document.querySelector('.advice');
  let image = document.querySelector('.image');
  
  button.addEventListener('click', function () {
    let randomElement = getRandomElement(phrases);
    smoothly(phrase, 'textContent', randomElement.text);
    smoothly(image, 'src', randomElement.image);  
  
  if (randomElement.text.length > 100) {
    advice.style.fontSize = '1vw';
  } else {
    advice.style.fontSize = '2vw';
  }
});

for (i = 0; i <= 0; i = i + 1) {
  let randomElement = getRandomElement(phrases);
  smoothly(phrase, 'textContent', phrases[i].text);
  smoothly(image, 'src', phrases[i].image);
}
